{
	"@name": "English",
	"welcome": "Welcome",
	"install_explain": "To install OMMP on your server, follow the instructions on this page and fill in the requested information. Do not go back in the installation process to avoid any problems.",
	"choose_language": "Choose a language",
	"fr": "Français",
	"en": "English",
	"continue": "Continue",
	"sql_connect": "Connection to MySQL",
	"sql_explain": "To operate, OMMP must connect to a MySQL database, please fill in the connection information to your database to verify its operation.",
	"fill_informations": "Fill in the informations",
	"db_user": "Username",
	"db_pass": "Password",
	"db_host": "Host",
	"db_name": "Database name",
	"db_prefix": "Tables prefix",
	"prefix_explain": "Prefix to use for tables if you use several installations of OMMP on the same database",
	"sql_error": "MySQL error",
	"back": "Back",
	"sql_error_explain": "OMMP failed to establish a connection with MySQL, check the information entered on the previous page and try again. If the problem persists check the status of your database.",
	"final_infos": "Final information",
	"final_explain": "Connection to MySQL worked successfully. You must now fill in the last information necessary for the configuration of the platform and the installation will be complete.",
	"platform_name": "Platform name",
	"platform_description": "Description of the platform",
	"mail_sender_name": "Name for sending emails",
	"ommp_team": "The OMMP Team",
	"mail_sender": "Address for sending emails",
	"demo_mail": "do-not-reply@",
	"contact_email": "Contact email address",
	"contact_demo": "contact@",
	"domain": "Installation domain",
	"example": "Example: ",
	"scheme": "Protocol",
	"install_dir": "Installation path",
	"create_admin": "Creation of the administrator",
	"admin_explain": "Fill in the information below to create the first platform administrator account. You can add other administrators later.",
	"username": "Username",
    "username_explain": "Alphanumeric characters, underscores and dots allowed",
    "email": "E-mail address",
    "email_explain": "To manage your account",
    "password": "Password",
    "password_explain": "At least 8 characters",
    "confirm_password": "Confirm your password",
	"longname": "Full name",
    "longname_explain": "Enter your full name if you want it displayed instead of your username",
	"error": "Error",
	"missing_parameter": "A parameter is missing",
	"name_required": "You must choose a name for the platform",
	"description_required": "You must choose a description for the platform",
	"mail_sender_name_required": "You must choose name for sending emails",
	"invalid_sender_email": "Please enter a valid sender email address",
	"invalid_contact_email": "Please enter a valid contact email address",
	"invalid_domain": "The domain is invalid",
	"invalid_scheme": "The protocol must be \"http\" or \"https\"",
	"invalid_dir": "The installation path must start and end with a \"/\"",
	"wrong_username": "Wrong format for username",
	"longname_too_long": "Your full name is too long",
	"invalid_admin_email": "The administrator's email address is not valid",
	"password_mismatch": "The two passwords do not match",
	"pass_too_short": "The password is too short",
	"create_table_error": "An unexpected problem occurred while creating the tables. This error cannot be corrected, try emptying your database and trying again.",
	"create_module_error": "An unexpected problem occurred while finalizing the installation of the modules. This error cannot be corrected, try emptying your database and trying again.",
	"create_settings_error": "An unexpected problem occurred while creating the configuration. This error cannot be corrected, try emptying your database and trying again.",
	"create_admin_error": "An unexpected problem occurred while creating the administrator account. This error cannot be corrected, try emptying your database and trying again.",
	"create_credentials_error": "An unexpected problem occurred while creating the credentials file. This error cannot be recovered, try to remove the installation and try again.",
	"success": "Success",
	"success_explain": "The installation was successful. OMMP is now installed with the settings you have chosen. You can now log in and start setting up and using your platform! Thank you for choosing OMMP.",
	"login": "Log in"
}