{
	"@name": "Français",
	"welcome": "Bienvenu",
	"install_explain": "Pour installer OMMP sur votre serveur, suivez les instructions sur cette page et remplissez les informations demandées. Ne revenez pas en arrière dans le processus d'installation pour éviter tout problème.",
	"choose_language": "Choisissez une langue",
	"fr": "Français",
	"en": "English",
	"continue": "Continuer",
	"sql_connect": "Connexion à MySQL",
	"sql_explain": "Pour fonctionner, OMMP doit se connecter à une base de données MySQL, veuillez remplir les informations de connexion à votre base afin de vérifier son fonctionnement.",
	"fill_informations": "Remplissez les informations",
	"db_user": "Utilisateur",
	"db_pass": "Mot de passe",
	"db_host": "Adresse de connexion",
	"db_name": "Nom de la base",
	"db_prefix": "Préfixe des tables",
	"prefix_explain": "Préfixe à utiliser pour les tables si vous utilisez plusieurs installations de OMMP sur une même base",
	"sql_error": "Erreur MySQL",
	"back": "Retour",
	"sql_error_explain": "OMMP n'a pas réussi à établir une connexion avec MySQL, vérifiez les informations entrées à la page précédente et réessayez. Si le problème persiste vérifiez l'état de votre base de données.",
	"final_infos": "Informations finales",
	"final_explain": "La connexion à MySQL a fonctionné avec succès. Vous devez maintenant remplir les dernières informations néscessaires à la configuration de la plateforme et l'installation sera terminée.",
	"platform_name": "Nom de la plateforme",
	"platform_description": "Description de la plateforme",
	"mail_sender_name": "Nom pour l'envoi de mails",
	"ommp_team": "L'Équipe OMMP",
	"mail_sender": "Adresse pour l'envoi de mails",
	"demo_mail": "ne-pas-repondre@",
	"contact_email": "Adresse email de contact",
	"contact_demo": "contact@",
	"domain": "Domaine d'installation",
	"example": "Exemple : ",
	"scheme": "Protocole",
	"install_dir": "Chemin de l'installation",
	"create_admin": "Création de l'administrateur",
	"admin_explain": "Remplissez les informations ci-dessous pour la création du premier compte administrateur de la plateforme. Vous pourrez ajouter d'autres administrateurs par la suite.",
	"username": "Nom d'utilisateur",
    "username_explain": "Caractères alphanumériques, tirets bas et points autorisés",
    "email": "Adresse e-mail",
    "email_explain": "Pour gérer votre compte",
    "password": "Mot de passe",
    "password_explain": "Au moins 8 caractères",
    "confirm_password": "Confirmez votre mot de passe",
	"longname": "Nom complet",
    "longname_explain": "Entrez votre nom complet si vous souhaitez qu'il soit affiché à la place de votre nom d'utilisateur",
	"error": "Erreur",
	"missing_parameter": "Il manque un paramètre",
	"name_required": "Vous devez choisir un nom pour la plateforme",
	"description_required": "Vous devez choisir une description pour la plateforme",
	"mail_sender_name_required": "Vous devez choisir nom pour l'envoi des mails",
	"invalid_sender_email": "Veuillez entrer une adresse d'envoi valide",
	"invalid_contact_email": "Veuillez entrer une adresse de contact valide",
	"invalid_domain": "Le domaine est invalide",
	"invalid_scheme": "Le protocole doit être \"http\" ou \"https\"",
	"invalid_dir": "Le chemin d'installation doit commencer et terminer par un \"/\"",
	"wrong_username": "Mauvais format pour le nom d'utilisateur",
	"longname_too_long": "Votre nom complet est trop long",
	"invalid_admin_email": "L'adresse email de l'administrateur n'est pas valide",
	"password_mismatch": "Les deux mot de passe ne correspondent pas",
	"pass_too_short": "Le mot de passe est trop court",
	"create_table_error": "Un problème inattendu est survenu lors de la création des tables. Cette erreur ne pourra pas être rattrapée, essayez de vider votre base de donnée et de réessayer.",
	"create_module_error": "Un problème inattendu est survenu lors de la finalisation de l'installation des modules. Cette erreur ne pourra pas être rattrapée, essayez de vider votre base de donnée et de réessayer.",
	"create_settings_error": "Un problème inattendu est survenu lors de la création de la configuration. Cette erreur ne pourra pas être rattrapée, essayez de vider votre base de donnée et de réessayer.",
	"create_admin_error": "Un problème inattendu est survenu lors de la création du compte administrateur. Cette erreur ne pourra pas être rattrapée, essayez de vider votre base de donnée et de réessayer.",
	"create_credentials_error": "Un problème inattendu est survenu lors de la création du fichier d'identifiants. Cette erreur ne pourra pas être rattrapée, essayez de supprimer l'installation et de réessayer.",
	"success": "Succès",
	"success_explain": "L'installation s'est déroulée correctement. OMMP est maintenant installé avec les paramètres que vous avez choisi. Vous pouvez dès maintenant vous connecter et commencer à paramétrer et utiliser votre plateforme ! Merci d'avoir choisi OMMP.",
	"login": "Connexion"
}